export const projects = {
    "Сложность 1" : {
        image: "/images/html.jpg",
        title: "Сложность1",
        skills: "Не требуются",
        tests: 35,
        video: 27,
        tasks: 50,
        chapters: [
            {
                title: "Проект 1",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                    "Задание 4",
                    "Задание 5",
                ]
            },
            {
                title: "Проект 2",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                ]
            },
        ]
    },

    "Сложность 2" : {
        image: "/images/js.jpg",
        title: "Сложность2",
        skills: "Не требуются",
        tests: 25,
        video: 40,
        tasks: 62,
        chapters: [
            {
                title: "Проект 1",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                    "Задание 4",
                    "Задание 5",
                ]
            },
            {
                title: "Проект 2",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                ]
            },
            {
                title: "Проект 3",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                    "Задание 4",
                ]
            },
            {
                title: "Проект 4",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                ]
            },
        ]
    },

    "Сложность 3" : {
        image: "/images/react-js.jpg",
        title: "Сложность3",
        skills: "Не требуются",
        tests: 25,
        video: 15,
        tasks: 35,
        chapters: [
            {
                title: "Проект 1",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                    "Задание 4",
                ]
            },
            {
                title: "Проект 2",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                ]
            },
        ]
    },

    "Сложность 4" : {
        image: "/images/react-js.jpg",
        title: "Сложность4",
        skills: "Не требуются",
        tests: 20,
        video: 25,
        tasks: 40,
        chapters: [
            {
                title: "Проект 1",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                    "Задание 4",
                ]
            },
            {
                title: "Проект 2",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                ]
            },
            {
                title: "Проект 3",
                themes: ["Задание 1",
                    "Задание 2",
                    "Задание 3",
                    "Задание 4",
                    "Задание 5",
                ]
            },
        ]
    },

}