export const theory = {
    html: {
        title: "HTML/CSS",
        skills: "Не требуются",
        tests: 25,
        video: 40,
        tasks: 62,
        chapters: [
            {
                title: "Глава 1. Введение в HTML",
                themes: ["HTML теги",
                    "Структура HTML-страницы",
                    "HTML - элементы. Виды и их применение",
                    "Атрибуты HTML-элементов",
                    "HTML. Работа с текстом",
                    "HTML - ссылки",
                ]
            },
            {
                title: "Глава 2. Работа с HTML",
                themes: ["Структура HTML страницы",
                    "HTML - элементы. Виды, отличия, применение. Работа с тегами",
                    "Стили в HTML", "CSS. Основы",
                    "CSS. Позиционирование элементов",
                    "HTML - контейнеры. Свойство display. Виды и поведение",
                    "CSS. Размеры элементов",
                    "CSS. Работа с текстом",
                    "Background-image vs Image. Когда что использовать",
                    "Flexbox вёрстка"
                ]
            },
            {
                title: "Таблица стилей CSS",
                themes: [
                    "Введение в CSS ",
                    "Селекторы и их виды",
                    "Псевдоклассы CSS",
                    "Псевдоэлементы CSS",
                    "CSS блочная модель",
                    "Блочные и строчные элементы CSS",
                    "Свойство ширины и высоты CSS",
                    "Таблица стилей CSS"
                ]
            },
            {
                title: "Работа с таблицей стилей CSS",
                themes: [
                    "CSS. Работа с текстом",
                    "CSS шрифты",
                    "CSS ссылки и свойство cursor",
                    "CSS. Работа со списками",
                    "CSS Рамка",
                    "CSS. Работа с таблицами",
                    "Тень элемента в CSS"
                ]
            },
            {
                title: "Flex верстка",
                themes: [
                    "Концепция flexbox",
                    "Основные свойства flex-контейнера",
                    "Основные свойства flex-элемента",
                ]
            }
        ]
    },

    javascript: {
        title: "Java Script",
        skills: "Не требуются",
        tests: 25,
        video: 40,
        tasks: 62,
        chapters: [
            {
                title: "Фундаментальный Javascript",
                themes: [
                    "Типы данных и переменные",
                    "Функции. Введение.",
                    "Функции. Работа с параметрами. Области видимости.",
                    "Функции. Return.",
                    "Условные операторы if и else.",
                    "Number. Работа с числами. Математические операции.",
                    "Number. Работа с числами. Основные свойства и методы.",
                    "Строки. Основные методы и свойства.",
                    "Строки. Поиск в строке, регулярные выражения.",
                ]
            },
            {
                title: "Взаимодействие с HTML",
                themes: [
                    "Document Object Model (DOM).",
                    "Поиск элементов в DOM",
                    "Манипуляция атрибутами HTML через JS",
                    "Создание элемента и добавление в DOM",
                    "Удаление из DOM",
                    "События",
                ]
            },
            {
                title: "Ассинхорнный Javascript",
                themes: [
                    "Функции. Callback и рекурсия. ",
                    "Promise. Видеолекция",
                    "Цепочка \"then\". Видеолекция",
                    "Обработка ошибок. Видеолекция",
                    "Альтернативная асинхронность. Async - Await",
                ]
            },
            {
                title: "Javascript анимация",
                themes: [
                    "Работа с методом setInterval",
                    "Метод requestAnimationFrame",
                    "Физика анимации."
                ]
            }
        ]
    },

    react: {
        title: "React JS",
        skills: "Не требуются",
        tests: 25,
        video: 40,
        tasks: 62,
        chapters: [
            {
                title: "Введение в React JS",
                themes: [
                    "Начало работы. Подключение ReactJS к проекту.",
                    "Create-react-app",
                    "Особенности JSX разметки.",
                    "Компоненты",
                    "Props.",
                    "Состояния.",
                    "Жизненный цикл компонентов.",
                    "Обработка событий и условный рендеринг",
                ]
            },
            {
                title: "Продвинутый React JS",
                themes: [
                    "Refs.",
                    "Итерация в React JS.",
                    "Композиция.",
                    "Single Page Application (SPA). Роутинг в ReactJS.",
                    "Компоненты высшего порядка (HOCs).",
                    "Хуки",
                    "React Context"
                ]
            }
        ]
    }
}